app/views/movies/_form.html.erb

      <li class="required">
        <%= f.collection_check_boxes(:genre_ids, Genre.all, :id, :name) %>
---
SELECT "genres".* FROM "genres"