app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("created_at", "movie_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-06-22 22:46:37.668228"], ["movie_id", 1], ["updated_at", "2015-06-22 22:46:37.668228"], ["user_id", 4]]
---
	def create
      @movie.favorites.create!(user: current_user)

SELECT  "favorites".* FROM "favorites"  WHERE "favorites"."user_id" = ? AND "favorites"."id" = ? LIMIT 1  [["user_id", 4], ["id", 6]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 6]]
---
    def destroy
       favorite = current_user.favorites.find(params[:id])
       favorite.destroy