app/controllers/movies_controller.rb

  def show
    @movie = Movie.find(params[:id])
    @fans = @movie.fans

    if current_user
      @current_favorite = current_user.favorites.find_by(movie_id: @movie.id)
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "favorites".* FROM "favorites"  WHERE "favorites"."user_id" = ? AND "favorites"."movie_id" = 3 LIMIT 1  [["user_id", 4]]

  def update
    @movie = Movie.find(params[:id])
    if @movie.update(movie_params)
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "description" = ?, "title" = ?, "updated_at" = ? WHERE "movies"."id" = 1  [["description", "\nTony Stark builds an armored suit to fight the throes of evil"], ["title", "Updated Movie Title"], ["updated_at", "2015-05-29 21:51:23.740437"]]