app/controllers/reviews_controller.rb

def create
    @review = @movie.reviews.new(review_params)
    if @review.save
---
INSERT INTO "reviews" ("comment", "created_at", "movie_id", "stars", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "cool"], ["created_at", "2015-06-18 01:28:44.279785"], ["movie_id", 1], ["stars", 3], ["updated_at", "2015-06-18 01:28:44.279785"], ["user_id", 4]]