app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."email" = 'michael.wiss@gmail.com' LIMIT 1
---
  def create
  	  if user = User.authenticate(params[:email], params[:password])
      user = User.find_by(email: params[:email])