app/controllers/users_controller.rb

    def create
    	@user = User.new(user_params)
    	if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ?, "username" = ? WHERE "users"."id" = 1  [["name", "Updated User Name"], ["updated_at", "2015-06-10 18:15:58.698025"], ["username", ""]]